file = {
     "metaData": {
          "requestParameters": {
               "busCount": 4,
               "expressbusCount": 0,
               "subwayCount": 2,
               "airplaneCount": 0,
               "locale": "ko",
               "endY": "37.5599922",
               "endX": "126.9753282",
               "wideareaRouteCount": 0,
               "subwayBusCount": 2,
               "startY": "37.5750599",
               "startX": "126.9720724",
               "ferryCount": 0,
               "trainCount": 2,
               "reqDttm": "20240724234710"
          },
          "plan": {
               "itineraries": [
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 1500,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 914,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 134,
                                   "distance": 185,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "서울경찰청.경복궁역",
                                        "lon": 126.97145,
                                        "lat": 37.57587777777778
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 7,
                                             "description": "좌회전 후 보행자도로 을 따라 7m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108"
                                        },
                                        {
                                             "streetName": "사직로",
                                             "distance": 103,
                                             "description": "경복궁역  7번출구 에서 좌회전 후 사직로 을 따라 103m 이동 ",
                                             "linestring": "126.972565,37.57566 126.97248,37.57573 126.97239,37.57574 126.97218,37.575764 126.971565,37.575832 126.97144,37.575844"
                                        }
                                   ]
                              },
                              {
                                   "routeColor": "0068B7",
                                   "distance": 1912,
                                   "start": {
                                        "name": "서울경찰청.경복궁역",
                                        "lon": 126.97145,
                                        "lat": 37.57587777777778
                                   },
                                   "Lane": [
                                        {
                                             "routeColor": "FF3300",
                                             "route": "광역:M7129",
                                             "routeId": "2976001",
                                             "service": 1,
                                             "type": 14
                                        }
                                   ],
                                   "type": 11,
                                   "mode": "BUS",
                                   "sectionTime": 533,
                                   "route": "간선:703",
                                   "routeId": "1062558001",
                                   "service": 1,
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "서울경찰청.경복궁역",
                                                  "lon": "126.971450",
                                                  "lat": "37.575878",
                                                  "stationID": "758478"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "세종문화회관",
                                                  "lon": "126.977019",
                                                  "lat": "37.573303",
                                                  "stationID": "789773"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "광화문.광화문빌딩",
                                                  "lon": "126.976800",
                                                  "lat": "37.569564",
                                                  "stationID": "758178"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "신한은행본점",
                                                  "lon": "126.975617",
                                                  "lat": "37.561258",
                                                  "stationID": "757786"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "신한은행본점",
                                        "lon": 126.97561666666667,
                                        "lat": 37.561258333333335
                                   },
                                   "passShape": {
                                        "linestring": "126.971433,37.575911 126.972733,37.575819 126.975258,37.575617 126.975606,37.575553 126.975839,37.575492 126.976350,37.575175 126.976628,37.575089 126.976944,37.575075 126.977136,37.575128 126.977133,37.574097 126.977156,37.573292 126.977169,37.572731 126.977183,37.570956 126.977114,37.570292 126.976814,37.570100 126.976828,37.569797 126.976831,37.569700 126.976839,37.569583 126.976861,37.569092 126.977033,37.567047 126.977108,37.565403 126.977103,37.565042 126.977081,37.564861 126.976978,37.564439 126.976856,37.564094 126.976800,37.563953 126.976469,37.563078 126.975953,37.561811 126.975761,37.561275 126.975750,37.561244"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 247,
                                   "distance": 230,
                                   "start": {
                                        "name": "신한은행본점",
                                        "lon": 126.97561666666667,
                                        "lat": 37.561258333333335
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "세종대로",
                                             "distance": 56,
                                             "description": "세종대로 을 따라 56m 이동",
                                             "linestring": "126.97558,37.561268 126.975426,37.56092 126.97537,37.5608"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 52,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 52m 이동 ",
                                             "linestring": "126.97537,37.5608 126.97596,37.560738"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 8,
                                             "description": "우회전 후 세종대로 을 따라 8m 이동 ",
                                             "linestring": "126.97596,37.560738 126.976006,37.56068"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.976006,37.56068 126.97604,37.560307"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 16,
                                             "description": "직진 후 16m 이동 ",
                                             "linestring": "126.97604,37.560307 126.97604,37.560276 126.97605,37.560154"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 38,
                                             "description": "다흰정 에서 횡단보도 후 38m 이동 ",
                                             "linestring": "126.97605,37.560154 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "좌회전 후 보행자도로 을 따라 18m 이동 ",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 381,
                         "transferCount": 0,
                         "totalDistance": 2163,
                         "pathType": 2,
                         "totalWalkDistance": 415
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 1500,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 1051,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 134,
                                   "distance": 185,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "서울경찰청.경복궁역",
                                        "lon": 126.97145,
                                        "lat": 37.57587777777778
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 7,
                                             "description": "좌회전 후 보행자도로 을 따라 7m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108"
                                        },
                                        {
                                             "streetName": "사직로",
                                             "distance": 103,
                                             "description": "경복궁역  7번출구 에서 좌회전 후 사직로 을 따라 103m 이동 ",
                                             "linestring": "126.972565,37.57566 126.97248,37.57573 126.97239,37.57574 126.97218,37.575764 126.971565,37.575832 126.97144,37.575844"
                                        }
                                   ]
                              },
                              {
                                   "mode": "BUS",
                                   "routeColor": "0068B7",
                                   "sectionTime": 650,
                                   "route": "간선:700",
                                   "routeId": "2863001",
                                   "distance": 2226,
                                   "service": 0,
                                   "start": {
                                        "name": "서울경찰청.경복궁역",
                                        "lon": 126.97145,
                                        "lat": 37.57587777777778
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "서울경찰청.경복궁역",
                                                  "lon": "126.971450",
                                                  "lat": "37.575878",
                                                  "stationID": "758478"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "세종문화회관",
                                                  "lon": "126.977017",
                                                  "lat": "37.573647",
                                                  "stationID": "789850"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "광화문.광화문빌딩",
                                                  "lon": "126.976800",
                                                  "lat": "37.569564",
                                                  "stationID": "758178"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "삼성본관앞",
                                                  "lon": "126.975953",
                                                  "lat": "37.562011",
                                                  "stationID": "757818"
                                             },
                                             {
                                                  "index": 4,
                                                  "stationName": "숭례문.한국일보",
                                                  "lon": "126.973967",
                                                  "lat": "37.558967",
                                                  "stationID": "757614"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "숭례문.한국일보",
                                        "lon": 126.97396666666667,
                                        "lat": 37.55896666666667
                                   },
                                   "type": 11,
                                   "passShape": {
                                        "linestring": "126.971433,37.575911 126.972733,37.575819 126.975258,37.575617 126.975606,37.575553 126.975839,37.575492 126.976350,37.575175 126.976628,37.575089 126.976944,37.575075 126.977136,37.575128 126.977133,37.574097 126.977144,37.573683 126.977169,37.572731 126.977183,37.570956 126.977114,37.570292 126.976814,37.570100 126.976828,37.569797 126.976831,37.569700 126.976839,37.569583 126.976861,37.569092 126.977033,37.567047 126.977108,37.565403 126.977103,37.565042 126.977081,37.564861 126.976978,37.564439 126.976856,37.564094 126.976800,37.563953 126.976469,37.563078 126.976042,37.562028 126.975953,37.561811 126.975761,37.561275 126.975533,37.560639 126.975394,37.560608 126.975125,37.560517 126.975003,37.560458 126.974867,37.560358 126.974664,37.560128 126.974592,37.559944 126.974525,37.559633 126.974450,37.559417 126.974242,37.559156 126.974056,37.558947"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 267,
                                   "distance": 335,
                                   "start": {
                                        "name": "숭례문.한국일보",
                                        "lon": 126.97396666666667,
                                        "lat": 37.55896666666667
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "세종대로",
                                             "distance": 22,
                                             "description": "세종대로 을 따라 22m 이동",
                                             "linestring": "126.973915,37.558994 126.97378,37.55883"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.97378,37.55883 126.973946,37.558735 126.97417,37.55862"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 185,
                                             "description": "남선빌딩 에서 좌회전 후 185m 이동 ",
                                             "linestring": "126.97417,37.55862 126.9746,37.55915 126.97468,37.559284 126.97475,37.559612 126.9748,37.559788 126.97485,37.559925 126.97491,37.56002 126.974976,37.560097 126.975,37.560123"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 69,
                                             "description": "우회전 후 세종대로 을 따라 69m 이동 ",
                                             "linestring": "126.975,37.560123 126.975075,37.560184 126.97518,37.560238 126.975296,37.56028 126.97541,37.56029 126.97548,37.560287 126.9755,37.560276 126.97555,37.56026 126.97558,37.560238 126.97561,37.560204 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 17,
                                             "description": "보행자도로, 17m",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 401,
                         "transferCount": 0,
                         "totalDistance": 2499,
                         "pathType": 2,
                         "totalWalkDistance": 520
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 1500,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 1099,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 233,
                                   "distance": 244,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "경복궁역",
                                        "lon": 126.972225,
                                        "lat": 37.576972222222224
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 7,
                                             "description": "좌회전 후 보행자도로 을 따라 7m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 37,
                                             "description": "경복궁역  7번출구 에서 횡단보도 후 37m 이동 ",
                                             "linestring": "126.97239,37.57574 126.97241,37.576073"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 10,
                                             "description": "직진 후 10m 이동 ",
                                             "linestring": "126.97241,37.576073 126.972374,37.57616"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 9,
                                             "description": "횡단보도 후 보행자도로 을 따라 9m 이동 ",
                                             "linestring": "126.972374,37.57616 126.97231,37.57622"
                                        },
                                        {
                                             "streetName": "자하문로",
                                             "distance": 87,
                                             "description": "경복궁역  1번출구 에서 직진 후 자하문로 을 따라 87m 이동 ",
                                             "linestring": "126.97231,37.57622 126.9724,37.5763 126.972374,37.576385 126.97237,37.576447 126.97235,37.57652 126.972336,37.576565 126.972305,37.576637 126.97219,37.576904 126.97217,37.576958"
                                        }
                                   ]
                              },
                              {
                                   "routeColor": "53B332",
                                   "distance": 1861,
                                   "start": {
                                        "name": "경복궁역",
                                        "lon": 126.972225,
                                        "lat": 37.576972222222224
                                   },
                                   "Lane": [
                                        {
                                             "routeColor": "53B332",
                                             "route": "지선:7022",
                                             "routeId": "11482001",
                                             "service": 0,
                                             "type": 12
                                        },
                                        {
                                             "routeColor": "53B332",
                                             "route": "마을:종로09",
                                             "routeId": "11498001",
                                             "service": 0,
                                             "type": 3
                                        }
                                   ],
                                   "type": 12,
                                   "mode": "BUS",
                                   "sectionTime": 524,
                                   "route": "지선:1711",
                                   "routeId": "11474001",
                                   "service": 0,
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "경복궁역",
                                                  "lon": "126.972225",
                                                  "lat": "37.576972",
                                                  "stationID": "758520"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "세종문화회관",
                                                  "lon": "126.977017",
                                                  "lat": "37.573647",
                                                  "stationID": "789850"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "시청앞.덕수궁",
                                                  "lon": "126.976942",
                                                  "lat": "37.566267",
                                                  "stationID": "758015"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "삼성본관앞",
                                                  "lon": "126.975953",
                                                  "lat": "37.562011",
                                                  "stationID": "757818"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "삼성본관앞",
                                        "lon": 126.97595277777778,
                                        "lat": 37.56201111111111
                                   },
                                   "passShape": {
                                        "linestring": "126.972256,37.577000 126.972433,37.576494 126.972481,37.576308 126.972531,37.575981 126.972733,37.575819 126.975258,37.575617 126.975606,37.575553 126.975839,37.575492 126.976350,37.575175 126.976628,37.575089 126.976944,37.575075 126.977136,37.575128 126.977133,37.574097 126.977144,37.573683 126.977169,37.572731 126.977183,37.570956 126.977114,37.570292 126.976814,37.570100 126.976828,37.569797 126.976831,37.569700 126.976861,37.569092 126.977033,37.567047 126.977069,37.566239 126.977108,37.565403 126.977103,37.565042 126.977081,37.564861 126.976978,37.564439 126.976856,37.564094 126.976800,37.563953 126.976469,37.563078 126.976042,37.562028"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 342,
                                   "distance": 321,
                                   "start": {
                                        "name": "삼성본관앞",
                                        "lon": 126.97595277777778,
                                        "lat": 37.56201111111111
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "세종대로",
                                             "distance": 7,
                                             "description": "세종대로 을 따라 7m 이동",
                                             "linestring": "126.97585,37.56204 126.97582,37.561977"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 16,
                                             "description": "횡단보도 후 보행자도로 을 따라 16m 이동 ",
                                             "linestring": "126.97582,37.561977 126.97578,37.561836"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 124,
                                             "description": "좌회전 후 세종대로 을 따라 124m 이동 ",
                                             "linestring": "126.97578,37.561836 126.975815,37.561813 126.97581,37.561783 126.975426,37.56092 126.97537,37.5608"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 53,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 53m 이동 ",
                                             "linestring": "126.97537,37.5608 126.97596,37.560738"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 7,
                                             "description": "우회전 후 세종대로 을 따라 7m 이동 ",
                                             "linestring": "126.97596,37.560738 126.976006,37.56068"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.976006,37.56068 126.97604,37.560307"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 17,
                                             "description": "직진 후 17m 이동 ",
                                             "linestring": "126.97604,37.560307 126.97604,37.560276 126.97605,37.560154"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 38,
                                             "description": "다흰정 에서 횡단보도 후 38m 이동 ",
                                             "linestring": "126.97605,37.560154 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 17,
                                             "description": "좌회전 후 보행자도로 을 따라 17m 이동 ",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 575,
                         "transferCount": 0,
                         "totalDistance": 2307,
                         "pathType": 2,
                         "totalWalkDistance": 565
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 3000,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 1030,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 501,
                                   "distance": 611,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "세종문화회관",
                                        "lon": 126.97701944444445,
                                        "lat": 37.573302777777776
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 87,
                                             "description": "우회전 후 87m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97262,37.57435 126.97261,37.57427"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 13,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 13m 이동 ",
                                             "linestring": "126.97261,37.57427 126.972755,37.574265"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 150,
                                             "description": "외환은행 내자동지점 에서 직진 후 150m 이동 ",
                                             "linestring": "126.972755,37.574265 126.97276,37.574203 126.972786,37.57417 126.97281,37.57415 126.972824,37.57414 126.97286,37.57414 126.9733,37.574146 126.9734,37.574146 126.97428,37.57416 126.97433,37.574165 126.974335,37.57417"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 29,
                                             "description": "우측 횡단보도 후 보행자도로 을 따라 29m 이동 ",
                                             "linestring": "126.974335,37.57417 126.97445,37.574085 126.97458,37.57399"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 167,
                                             "description": "좌회전 후 167m 이동 ",
                                             "linestring": "126.97458,37.57399 126.97459,37.573994 126.974625,37.573997 126.97531,37.574055 126.97544,37.57407 126.975586,37.574085 126.975716,37.574093 126.97576,37.574097 126.97614,37.574116 126.97625,37.57412 126.976295,37.574127 126.97631,37.574135 126.97637,37.57416 126.9764,37.57421"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 45,
                                             "description": "우회전 후 보행자도로 을 따라 45m 이동 ",
                                             "linestring": "126.9764,37.57421 126.976585,37.57423 126.97669,37.574238 126.97692,37.574253"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 106,
                                             "description": "광화문광장 에서 우회전 후 세종대로 을 따라 106m 이동 ",
                                             "linestring": "126.97692,37.574253 126.97692,37.5742 126.97692,37.57417 126.97692,37.57411 126.97691,37.574047 126.97692,37.57372 126.97693,37.5733"
                                        }
                                   ]
                              },
                              {
                                   "routeColor": "FF3300",
                                   "distance": 1342,
                                   "start": {
                                        "name": "세종문화회관",
                                        "lon": 126.97701944444445,
                                        "lat": 37.573302777777776
                                   },
                                   "Lane": [
                                        {
                                             "routeColor": "FF3300",
                                             "route": "직행좌석:5005",
                                             "routeId": "1984001",
                                             "service": 0,
                                             "type": 4
                                        },
                                        {
                                             "routeColor": "FF3300",
                                             "route": "직행좌석:5500-2",
                                             "routeId": "1730001",
                                             "service": 0,
                                             "type": 4
                                        },
                                        {
                                             "routeColor": "FF3300",
                                             "route": "직행좌석:5000A",
                                             "routeId": "1977001",
                                             "service": 0,
                                             "type": 4
                                        },
                                        {
                                             "routeColor": "FF3300",
                                             "route": "직행좌석:5000B",
                                             "routeId": "1978001",
                                             "service": 0,
                                             "type": 4
                                        }
                                   ],
                                   "type": 14,
                                   "mode": "BUS",
                                   "sectionTime": 282,
                                   "route": "광역:9401",
                                   "routeId": "1908001",
                                   "service": 0,
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "세종문화회관",
                                                  "lon": "126.977019",
                                                  "lat": "37.573303",
                                                  "stationID": "789773"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "신한은행본점",
                                                  "lon": "126.975617",
                                                  "lat": "37.561258",
                                                  "stationID": "757786"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "신한은행본점",
                                        "lon": 126.97561666666667,
                                        "lat": 37.561258333333335
                                   },
                                   "passShape": {
                                        "linestring": "126.977156,37.573292 126.977169,37.572731 126.977183,37.570956 126.977114,37.570292 126.976814,37.570100 126.976828,37.569797 126.976831,37.569700 126.976861,37.569092 126.977033,37.567047 126.977108,37.565403 126.977103,37.565042 126.977081,37.564861 126.976978,37.564439 126.976856,37.564094 126.976800,37.563953 126.976469,37.563078 126.975953,37.561811 126.975761,37.561275 126.975750,37.561244"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 247,
                                   "distance": 230,
                                   "start": {
                                        "name": "신한은행본점",
                                        "lon": 126.97561666666667,
                                        "lat": 37.561258333333335
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "세종대로",
                                             "distance": 56,
                                             "description": "세종대로 을 따라 56m 이동",
                                             "linestring": "126.97558,37.561268 126.975426,37.56092 126.97537,37.5608"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 52,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 52m 이동 ",
                                             "linestring": "126.97537,37.5608 126.97596,37.560738"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 8,
                                             "description": "우회전 후 세종대로 을 따라 8m 이동 ",
                                             "linestring": "126.97596,37.560738 126.976006,37.56068"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.976006,37.56068 126.97604,37.560307"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 16,
                                             "description": "직진 후 16m 이동 ",
                                             "linestring": "126.97604,37.560307 126.97604,37.560276 126.97605,37.560154"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 38,
                                             "description": "다흰정 에서 횡단보도 후 38m 이동 ",
                                             "linestring": "126.97605,37.560154 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "좌회전 후 보행자도로 을 따라 18m 이동 ",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 748,
                         "transferCount": 0,
                         "totalDistance": 1965,
                         "pathType": 2,
                         "totalWalkDistance": 841
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 1500,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 1774,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 230,
                                   "distance": 240,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 68,
                                             "description": "좌회전 후 68m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108 126.972595,37.575386 126.97257,37.575645 126.972565,37.57566"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 14,
                                             "description": "경복궁역  7번출구 에서 우측 횡단보도 후 보행자도로 을 따라 14m 이동 ",
                                             "linestring": "126.972565,37.57566 126.97271,37.575638"
                                        },
                                        {
                                             "streetName": "사직로",
                                             "distance": 79,
                                             "description": "경복궁역  7번출구 에서 직진 후 사직로 을 따라 79m 이동 ",
                                             "linestring": "126.97271,37.575638 126.97276,37.5757 126.97278,37.5757 126.973206,37.575653 126.973564,37.57562"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 39,
                                             "description": "광화문칼국수 에서 좌측 횡단보도 후 39m 이동 ",
                                             "linestring": "126.973564,37.57562 126.973595,37.575974"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 26,
                                             "description": "아이러브플라워(I LOVE 에서 우회전 후 보행자도로 을 따라 26m 이동 ",
                                             "linestring": "126.973595,37.575974 126.97382,37.57595 126.973885,37.575947"
                                        }
                                   ]
                              },
                              {
                                   "mode": "SUBWAY",
                                   "routeColor": "EF7C1C",
                                   "sectionTime": 308,
                                   "route": "수도권3호선",
                                   "routeId": "110031010",
                                   "distance": 2347,
                                   "service": 1,
                                   "start": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "경복궁",
                                                  "lon": "126.973867",
                                                  "lat": "37.575819",
                                                  "stationID": "110319"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "안국",
                                                  "lon": "126.985356",
                                                  "lat": "37.576506",
                                                  "stationID": "110320"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "종로3가",
                                                  "lon": "126.991825",
                                                  "lat": "37.571708",
                                                  "stationID": "110321"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "을지로3가",
                                                  "lon": "126.992569",
                                                  "lat": "37.566803",
                                                  "stationID": "110322"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "을지로3가",
                                        "lon": 126.99256944444444,
                                        "lat": 37.56680277777778
                                   },
                                   "type": 3,
                                   "passShape": {
                                        "linestring": "126.973867,37.575819 126.974297,37.575775 126.975078,37.575753 126.976378,37.575706 126.977056,37.575706 126.978153,37.575742 126.978583,37.575764 126.979089,37.575803 126.979558,37.575850 126.980111,37.575875 126.980367,37.575869 126.980625,37.575847 126.981281,37.575772 126.981722,37.575703 126.982542,37.575539 126.982569,37.575533 126.982628,37.575528 126.982683,37.575525 126.982739,37.575525 126.982794,37.575525 126.982822,37.575528 126.982850,37.575528 126.982906,37.575536 126.982933,37.575539 126.982989,37.575550 126.983042,37.575564 126.983069,37.575572 126.983119,37.575589 126.984275,37.576042 126.985356,37.576506 126.985803,37.576700 126.986114,37.576842 126.986639,37.577117 126.986678,37.577133 126.986756,37.577167 126.986836,37.577194 126.986917,37.577222 126.987000,37.577247 126.987042,37.577256 126.987125,37.577278 126.987208,37.577292 126.987253,37.577300 126.987339,37.577314 126.987381,37.577317 126.987469,37.577325 126.987514,37.577328 126.989664,37.577347 126.989700,37.577344 126.989736,37.577342 126.989772,37.577336 126.989808,37.577328 126.989842,37.577319 126.989878,37.577308 126.989908,37.577294 126.989942,37.577281 126.989969,37.577264 126.990000,37.577247 126.990028,37.577228 126.990053,37.577206 126.990078,37.577183 126.990100,37.577161 126.990119,37.577136 126.990136,37.577111 126.990153,37.577083 126.990167,37.577058 126.990178,37.577031 126.990183,37.577003 126.990353,37.576500 126.990375,37.576428 126.991242,37.573556 126.991544,37.572597 126.991825,37.571708 126.992050,37.570994 126.992083,37.570836 126.992142,37.570472 126.992147,37.570433 126.992367,37.568378 126.992628,37.566381"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 217,
                                   "distance": 268,
                                   "start": {
                                        "name": "을지로3가",
                                        "lon": 126.99256944444444,
                                        "lat": 37.56680277777778
                                   },
                                   "end": {
                                        "name": "을지로3가",
                                        "lon": 126.99026944444445,
                                        "lat": 37.56636388888889
                                   },
                                   "passShape": {
                                        "linestring": "126.992569,37.566803 126.992603,37.566483 126.992608,37.566411 126.992614,37.566369 126.992453,37.566358 126.992442,37.566469 126.992283,37.566458 126.992258,37.566472 126.991958,37.566458 126.990858,37.566392 126.990269,37.566364"
                                   }
                              },
                              {
                                   "mode": "BUS",
                                   "routeColor": "0068B7",
                                   "sectionTime": 572,
                                   "route": "간선:261",
                                   "routeId": "11444001",
                                   "distance": 1747,
                                   "service": 0,
                                   "start": {
                                        "name": "을지로3가",
                                        "lon": 126.99026944444445,
                                        "lat": 37.56636388888889
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "을지로3가",
                                                  "lon": "126.990269",
                                                  "lat": "37.566364",
                                                  "stationID": "758017"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "을지로2가.기업은행본점.서울노동청",
                                                  "lon": "126.986603",
                                                  "lat": "37.566239",
                                                  "stationID": "758010"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "롯데백화점",
                                                  "lon": "126.982206",
                                                  "lat": "37.564414",
                                                  "stationID": "757930"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "북창동.남대문시장",
                                                  "lon": "126.978156",
                                                  "lat": "37.561181",
                                                  "stationID": "757777"
                                             },
                                             {
                                                  "index": 4,
                                                  "stationName": "염천교",
                                                  "lon": "126.973025",
                                                  "lat": "37.559836",
                                                  "stationID": "757671"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "염천교",
                                        "lon": 126.973025,
                                        "lat": 37.55983611111111
                                   },
                                   "type": 11,
                                   "passShape": {
                                        "linestring": "126.990267,37.566328 126.989831,37.566306 126.987633,37.566228 126.987450,37.566222 126.986619,37.566203 126.983514,37.566139 126.982764,37.566119 126.982572,37.565969 126.982503,37.565478 126.982447,37.565150 126.982347,37.564731 126.982253,37.564417 126.982053,37.563753 126.982022,37.563653 126.981739,37.562919 126.981653,37.562744 126.981242,37.562056 126.981125,37.561928 126.980483,37.561642 126.980083,37.561503 126.979778,37.561433 126.978447,37.561203 126.978164,37.561144 126.977639,37.561042 126.977372,37.560969 126.976439,37.560653 126.976175,37.560603 126.975919,37.560614 126.975722,37.560639 126.975533,37.560639 126.975394,37.560608 126.975125,37.560517 126.975003,37.560458 126.974867,37.560358 126.974664,37.560128 126.974364,37.559972 126.974017,37.559878 126.973019,37.559800"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 447,
                                   "distance": 547,
                                   "start": {
                                        "name": "염천교",
                                        "lon": 126.973025,
                                        "lat": 37.55983611111111
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "칠패로",
                                             "distance": 6,
                                             "description": "칠패로 을 따라 6m 이동",
                                             "linestring": "126.97303,37.5598 126.97296,37.55979"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 25,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 25m 이동 ",
                                             "linestring": "126.97296,37.55979 126.97299,37.55957"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 81,
                                             "description": "연세봉래빌딩 에서 좌회전 후 81m 이동 ",
                                             "linestring": "126.97299,37.55957 126.97306,37.559574 126.97309,37.559574 126.97353,37.559624 126.97382,37.559654 126.97391,37.559654"
                                        },
                                        {
                                             "streetName": "칠패로",
                                             "distance": 39,
                                             "description": "우회전 후 칠패로 을 따라 39m 이동 ",
                                             "linestring": "126.97391,37.559654 126.97405,37.55966 126.97406,37.55966 126.97408,37.559654 126.97417,37.55952 126.97419,37.55946"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.97378,37.55883 126.973946,37.558735 126.97417,37.55862"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 186,
                                             "description": "남선빌딩 에서 좌회전 후 186m 이동 ",
                                             "linestring": "126.97417,37.55862 126.9746,37.55915 126.97468,37.559284 126.97475,37.559612 126.9748,37.559788 126.97485,37.559925 126.97491,37.56002 126.974976,37.560097 126.975,37.560123"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 68,
                                             "description": "우회전 후 세종대로 을 따라 68m 이동 ",
                                             "linestring": "126.975,37.560123 126.975075,37.560184 126.97518,37.560238 126.975296,37.56028 126.97541,37.56029 126.97548,37.560287 126.9755,37.560276 126.97555,37.56026 126.97558,37.560238 126.97561,37.560204 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "보행자도로, 18m",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 894,
                         "transferCount": 1,
                         "totalDistance": 4746,
                         "pathType": 3,
                         "totalWalkDistance": 1055
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 1400,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 1501,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 230,
                                   "distance": 240,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 68,
                                             "description": "좌회전 후 68m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108 126.972595,37.575386 126.97257,37.575645 126.972565,37.57566"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 14,
                                             "description": "경복궁역  7번출구 에서 우측 횡단보도 후 보행자도로 을 따라 14m 이동 ",
                                             "linestring": "126.972565,37.57566 126.97271,37.575638"
                                        },
                                        {
                                             "streetName": "사직로",
                                             "distance": 79,
                                             "description": "경복궁역  7번출구 에서 직진 후 사직로 을 따라 79m 이동 ",
                                             "linestring": "126.97271,37.575638 126.97276,37.5757 126.97278,37.5757 126.973206,37.575653 126.973564,37.57562"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 39,
                                             "description": "광화문칼국수 에서 좌측 횡단보도 후 39m 이동 ",
                                             "linestring": "126.973564,37.57562 126.973595,37.575974"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 26,
                                             "description": "아이러브플라워(I LOVE 에서 우회전 후 보행자도로 을 따라 26m 이동 ",
                                             "linestring": "126.973595,37.575974 126.97382,37.57595 126.973885,37.575947"
                                        }
                                   ]
                              },
                              {
                                   "mode": "SUBWAY",
                                   "routeColor": "EF7C1C",
                                   "sectionTime": 308,
                                   "route": "수도권3호선",
                                   "routeId": "110031010",
                                   "distance": 2347,
                                   "service": 1,
                                   "start": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "경복궁",
                                                  "lon": "126.973867",
                                                  "lat": "37.575819",
                                                  "stationID": "110319"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "안국",
                                                  "lon": "126.985356",
                                                  "lat": "37.576506",
                                                  "stationID": "110320"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "종로3가",
                                                  "lon": "126.991825",
                                                  "lat": "37.571708",
                                                  "stationID": "110321"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "을지로3가",
                                                  "lon": "126.992569",
                                                  "lat": "37.566803",
                                                  "stationID": "110322"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "을지로3가",
                                        "lon": 126.99256944444444,
                                        "lat": 37.56680277777778
                                   },
                                   "type": 3,
                                   "passShape": {
                                        "linestring": "126.973867,37.575819 126.974297,37.575775 126.975078,37.575753 126.976378,37.575706 126.977056,37.575706 126.978153,37.575742 126.978583,37.575764 126.979089,37.575803 126.979558,37.575850 126.980111,37.575875 126.980367,37.575869 126.980625,37.575847 126.981281,37.575772 126.981722,37.575703 126.982542,37.575539 126.982569,37.575533 126.982628,37.575528 126.982683,37.575525 126.982739,37.575525 126.982794,37.575525 126.982822,37.575528 126.982850,37.575528 126.982906,37.575536 126.982933,37.575539 126.982989,37.575550 126.983042,37.575564 126.983069,37.575572 126.983119,37.575589 126.984275,37.576042 126.985356,37.576506 126.985803,37.576700 126.986114,37.576842 126.986639,37.577117 126.986678,37.577133 126.986756,37.577167 126.986836,37.577194 126.986917,37.577222 126.987000,37.577247 126.987042,37.577256 126.987125,37.577278 126.987208,37.577292 126.987253,37.577300 126.987339,37.577314 126.987381,37.577317 126.987469,37.577325 126.987514,37.577328 126.989664,37.577347 126.989700,37.577344 126.989736,37.577342 126.989772,37.577336 126.989808,37.577328 126.989842,37.577319 126.989878,37.577308 126.989908,37.577294 126.989942,37.577281 126.989969,37.577264 126.990000,37.577247 126.990028,37.577228 126.990053,37.577206 126.990078,37.577183 126.990100,37.577161 126.990119,37.577136 126.990136,37.577111 126.990153,37.577083 126.990167,37.577058 126.990178,37.577031 126.990183,37.577003 126.990353,37.576500 126.990375,37.576428 126.991242,37.573556 126.991544,37.572597 126.991825,37.571708 126.992050,37.570994 126.992083,37.570836 126.992142,37.570472 126.992147,37.570433 126.992367,37.568378 126.992628,37.566381"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 176,
                                   "distance": 211,
                                   "start": {
                                        "name": "을지로3가",
                                        "lon": 126.99256944444444,
                                        "lat": 37.56680277777778
                                   },
                                   "end": {
                                        "name": "을지로3가",
                                        "lon": 126.99092777777778,
                                        "lat": 37.56628611111111
                                   },
                                   "passShape": {
                                        "linestring": "126.992569,37.566803 126.992603,37.566483 126.992608,37.566411 126.992614,37.566369 126.992453,37.566358 126.992442,37.566469 126.992283,37.566458 126.992258,37.566472 126.991958,37.566458 126.990928,37.566286"
                                   }
                              },
                              {
                                   "mode": "SUBWAY",
                                   "routeColor": "009D3E",
                                   "sectionTime": 228,
                                   "route": "수도권2호선",
                                   "routeId": "110021018",
                                   "distance": 1422,
                                   "service": 0,
                                   "start": {
                                        "name": "을지로3가",
                                        "lon": 126.99092777777778,
                                        "lat": 37.56628611111111
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "을지로3가",
                                                  "lon": "126.990928",
                                                  "lat": "37.566286",
                                                  "stationID": "110203"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "을지로입구",
                                                  "lon": "126.982275",
                                                  "lat": "37.566042",
                                                  "stationID": "110202"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "시청",
                                                  "lon": "126.975494",
                                                  "lat": "37.563625",
                                                  "stationID": "110201"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "시청",
                                        "lon": 126.97549444444445,
                                        "lat": 37.563625
                                   },
                                   "type": 2,
                                   "passShape": {
                                        "linestring": "126.990928,37.566300 126.990792,37.566292 126.990442,37.566269 126.989678,37.566217 126.987503,37.566153 126.983975,37.566114 126.983703,37.566114 126.983081,37.566078 126.982408,37.566044 126.982275,37.566042 126.980883,37.566008 126.979700,37.566000 126.979581,37.565994 126.979464,37.565983 126.979350,37.565969 126.979233,37.565950 126.979119,37.565928 126.979006,37.565900 126.978894,37.565869 126.978786,37.565833 126.978678,37.565792 126.978575,37.565750 126.978472,37.565700 126.978375,37.565650 126.978278,37.565594 126.978186,37.565536 126.978097,37.565475 126.978014,37.565408 126.977933,37.565339 126.977856,37.565267 126.977800,37.565211 126.977783,37.565194 126.977717,37.565117 126.977653,37.565039 126.977619,37.564989 126.977586,37.564939 126.977550,37.564889 126.977514,37.564842 126.977475,37.564792 126.977436,37.564744 126.977394,37.564700 126.977353,37.564656 126.977311,37.564608 126.977267,37.564567 126.977219,37.564522 126.977175,37.564481 126.977128,37.564439 126.977078,37.564397 126.977028,37.564356 126.976975,37.564317 126.976972,37.564317 126.976925,37.564281 126.976869,37.564242 126.976817,37.564206 126.976761,37.564169 126.976706,37.564136 126.976047,37.563836 126.975703,37.563706"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 559,
                                   "distance": 620,
                                   "start": {
                                        "name": "시청",
                                        "lon": 126.97549444444445,
                                        "lat": 37.563625
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "",
                                             "distance": 87,
                                             "description": "87m 이동",
                                             "linestring": "126.97548,37.56365 126.97564,37.563713 126.97637,37.56398"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 30,
                                             "description": "시청역  8번출구 에서 우회전 후 30m 이동 ",
                                             "linestring": "126.97637,37.56398 126.976524,37.563763 126.976524,37.563747"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 3,
                                             "description": "하나투어 서울국제연합여행사점 에서 좌회전 후 3m 이동 ",
                                             "linestring": "126.976524,37.563747 126.97654,37.56372"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 140,
                                             "description": "STCO 시청점 에서 2시 방향 우회전 후 세종대로 을 따라 140m 이동 ",
                                             "linestring": "126.97654,37.56372 126.97652,37.563656 126.97611,37.56271 126.97609,37.562626 126.97608,37.562595 126.97605,37.56252"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 46,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 46m 이동 ",
                                             "linestring": "126.97605,37.56252 126.97655,37.56239"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 199,
                                             "description": "파리바게뜨 시청역점 에서 우회전 후 세종대로 을 따라 199m 이동 ",
                                             "linestring": "126.97655,37.56239 126.97653,37.56237 126.97649,37.56225 126.97636,37.56193 126.97622,37.561573 126.97609,37.56125 126.97607,37.56118 126.97597,37.560947 126.975945,37.560867 126.97594,37.560825 126.97594,37.5608 126.97596,37.560738 126.976006,37.56068"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.976006,37.56068 126.97604,37.560307"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 17,
                                             "description": "직진 후 17m 이동 ",
                                             "linestring": "126.97604,37.560307 126.97604,37.560276 126.97605,37.560154"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 38,
                                             "description": "다흰정 에서 횡단보도 후 38m 이동 ",
                                             "linestring": "126.97605,37.560154 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "좌회전 후 보행자도로 을 따라 18m 이동 ",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 965,
                         "transferCount": 1,
                         "totalDistance": 4565,
                         "pathType": 1,
                         "totalWalkDistance": 1071
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 1500,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 1621,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 230,
                                   "distance": 240,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 68,
                                             "description": "좌회전 후 68m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108 126.972595,37.575386 126.97257,37.575645 126.972565,37.57566"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 14,
                                             "description": "경복궁역  7번출구 에서 우측 횡단보도 후 보행자도로 을 따라 14m 이동 ",
                                             "linestring": "126.972565,37.57566 126.97271,37.575638"
                                        },
                                        {
                                             "streetName": "사직로",
                                             "distance": 79,
                                             "description": "경복궁역  7번출구 에서 직진 후 사직로 을 따라 79m 이동 ",
                                             "linestring": "126.97271,37.575638 126.97276,37.5757 126.97278,37.5757 126.973206,37.575653 126.973564,37.57562"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 39,
                                             "description": "광화문칼국수 에서 좌측 횡단보도 후 39m 이동 ",
                                             "linestring": "126.973564,37.57562 126.973595,37.575974"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 26,
                                             "description": "아이러브플라워(I LOVE 에서 우회전 후 보행자도로 을 따라 26m 이동 ",
                                             "linestring": "126.973595,37.575974 126.97382,37.57595 126.973885,37.575947"
                                        }
                                   ]
                              },
                              {
                                   "mode": "SUBWAY",
                                   "routeColor": "EF7C1C",
                                   "sectionTime": 308,
                                   "route": "수도권3호선",
                                   "routeId": "110031010",
                                   "distance": 2347,
                                   "service": 1,
                                   "start": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "경복궁",
                                                  "lon": "126.973867",
                                                  "lat": "37.575819",
                                                  "stationID": "110319"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "안국",
                                                  "lon": "126.985356",
                                                  "lat": "37.576506",
                                                  "stationID": "110320"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "종로3가",
                                                  "lon": "126.991825",
                                                  "lat": "37.571708",
                                                  "stationID": "110321"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "을지로3가",
                                                  "lon": "126.992569",
                                                  "lat": "37.566803",
                                                  "stationID": "110322"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "을지로3가",
                                        "lon": 126.99256944444444,
                                        "lat": 37.56680277777778
                                   },
                                   "type": 3,
                                   "passShape": {
                                        "linestring": "126.973867,37.575819 126.974297,37.575775 126.975078,37.575753 126.976378,37.575706 126.977056,37.575706 126.978153,37.575742 126.978583,37.575764 126.979089,37.575803 126.979558,37.575850 126.980111,37.575875 126.980367,37.575869 126.980625,37.575847 126.981281,37.575772 126.981722,37.575703 126.982542,37.575539 126.982569,37.575533 126.982628,37.575528 126.982683,37.575525 126.982739,37.575525 126.982794,37.575525 126.982822,37.575528 126.982850,37.575528 126.982906,37.575536 126.982933,37.575539 126.982989,37.575550 126.983042,37.575564 126.983069,37.575572 126.983119,37.575589 126.984275,37.576042 126.985356,37.576506 126.985803,37.576700 126.986114,37.576842 126.986639,37.577117 126.986678,37.577133 126.986756,37.577167 126.986836,37.577194 126.986917,37.577222 126.987000,37.577247 126.987042,37.577256 126.987125,37.577278 126.987208,37.577292 126.987253,37.577300 126.987339,37.577314 126.987381,37.577317 126.987469,37.577325 126.987514,37.577328 126.989664,37.577347 126.989700,37.577344 126.989736,37.577342 126.989772,37.577336 126.989808,37.577328 126.989842,37.577319 126.989878,37.577308 126.989908,37.577294 126.989942,37.577281 126.989969,37.577264 126.990000,37.577247 126.990028,37.577228 126.990053,37.577206 126.990078,37.577183 126.990100,37.577161 126.990119,37.577136 126.990136,37.577111 126.990153,37.577083 126.990167,37.577058 126.990178,37.577031 126.990183,37.577003 126.990353,37.576500 126.990375,37.576428 126.991242,37.573556 126.991544,37.572597 126.991825,37.571708 126.992050,37.570994 126.992083,37.570836 126.992142,37.570472 126.992147,37.570433 126.992367,37.568378 126.992628,37.566381"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 217,
                                   "distance": 268,
                                   "start": {
                                        "name": "을지로3가",
                                        "lon": 126.99256944444444,
                                        "lat": 37.56680277777778
                                   },
                                   "end": {
                                        "name": "을지로3가",
                                        "lon": 126.99026944444445,
                                        "lat": 37.56636388888889
                                   },
                                   "passShape": {
                                        "linestring": "126.992569,37.566803 126.992603,37.566483 126.992608,37.566411 126.992614,37.566369 126.992453,37.566358 126.992442,37.566469 126.992283,37.566458 126.992258,37.566472 126.991958,37.566458 126.990858,37.566392 126.990269,37.566364"
                                   }
                              },
                              {
                                   "routeColor": "0068B7",
                                   "distance": 1777,
                                   "start": {
                                        "name": "을지로3가",
                                        "lon": 126.99026944444445,
                                        "lat": 37.56636388888889
                                   },
                                   "Lane": [
                                        {
                                             "routeColor": "0068B7",
                                             "route": "간선:202",
                                             "routeId": "3078001",
                                             "service": 0,
                                             "type": 11
                                        },
                                        {
                                             "routeColor": "0068B7",
                                             "route": "간선:100",
                                             "routeId": "11421001",
                                             "service": 0,
                                             "type": 11
                                        },
                                        {
                                             "routeColor": "0068B7",
                                             "route": "간선:N30",
                                             "routeId": "11470001",
                                             "service": 0,
                                             "type": 11
                                        }
                                   ],
                                   "type": 11,
                                   "mode": "BUS",
                                   "sectionTime": 582,
                                   "route": "간선:152",
                                   "routeId": "2241001",
                                   "service": 0,
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "을지로3가",
                                                  "lon": "126.990269",
                                                  "lat": "37.566364",
                                                  "stationID": "758017"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "을지로2가.기업은행본점.서울노동청",
                                                  "lon": "126.986603",
                                                  "lat": "37.566239",
                                                  "stationID": "758010"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "롯데백화점",
                                                  "lon": "126.982206",
                                                  "lat": "37.564414",
                                                  "stationID": "757930"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "북창동.남대문시장",
                                                  "lon": "126.978156",
                                                  "lat": "37.561181",
                                                  "stationID": "757777"
                                             },
                                             {
                                                  "index": 4,
                                                  "stationName": "숭례문",
                                                  "lon": "126.973528",
                                                  "lat": "37.558469",
                                                  "stationID": "757582"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "숭례문",
                                        "lon": 126.97352777777778,
                                        "lat": 37.55846944444444
                                   },
                                   "passShape": {
                                        "linestring": "126.990267,37.566328 126.989831,37.566306 126.987633,37.566228 126.987450,37.566222 126.986619,37.566203 126.983514,37.566139 126.982764,37.566119 126.982572,37.565969 126.982503,37.565478 126.982447,37.565150 126.982347,37.564731 126.982253,37.564417 126.982053,37.563753 126.982022,37.563653 126.981739,37.562919 126.981653,37.562744 126.981242,37.562056 126.981125,37.561928 126.980483,37.561642 126.980083,37.561503 126.979778,37.561433 126.978447,37.561203 126.978164,37.561144 126.977639,37.561042 126.977372,37.560969 126.976439,37.560653 126.976175,37.560603 126.975919,37.560614 126.975722,37.560639 126.975533,37.560639 126.975394,37.560608 126.975125,37.560517 126.975003,37.560458 126.974867,37.560358 126.974664,37.560128 126.974592,37.559944 126.974558,37.559800 126.974525,37.559633 126.974450,37.559417 126.974242,37.559156 126.973617,37.558456"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 284,
                                   "distance": 359,
                                   "start": {
                                        "name": "숭례문",
                                        "lon": 126.97352777777778,
                                        "lat": 37.55846944444444
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "세종대로",
                                             "distance": 45,
                                             "description": "세종대로 을 따라 45m 이동",
                                             "linestring": "126.97348,37.5585 126.97364,37.558678 126.97378,37.55883"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "우측 횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.97378,37.55883 126.973946,37.558735 126.97417,37.55862"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 186,
                                             "description": "남선빌딩 에서 좌회전 후 186m 이동 ",
                                             "linestring": "126.97417,37.55862 126.9746,37.55915 126.97468,37.559284 126.97475,37.559612 126.9748,37.559788 126.97485,37.559925 126.97491,37.56002 126.974976,37.560097 126.975,37.560123"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 68,
                                             "description": "우회전 후 세종대로 을 따라 68m 이동 ",
                                             "linestring": "126.975,37.560123 126.975075,37.560184 126.97518,37.560238 126.975296,37.56028 126.97541,37.56029 126.97548,37.560287 126.9755,37.560276 126.97555,37.56026 126.97558,37.560238 126.97561,37.560204 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "보행자도로, 18m",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 731,
                         "transferCount": 1,
                         "totalDistance": 4805,
                         "pathType": 3,
                         "totalWalkDistance": 867
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 1400,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 1963,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 551,
                                   "distance": 675,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "광화문",
                                        "lon": 126.97622777777778,
                                        "lat": 37.571644444444445
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 87,
                                             "description": "우회전 후 87m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97262,37.57435 126.97261,37.57427"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 13,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 13m 이동 ",
                                             "linestring": "126.97261,37.57427 126.972755,37.574265"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 150,
                                             "description": "외환은행 내자동지점 에서 직진 후 150m 이동 ",
                                             "linestring": "126.972755,37.574265 126.97276,37.574203 126.972786,37.57417 126.97281,37.57415 126.972824,37.57414 126.97286,37.57414 126.9733,37.574146 126.9734,37.574146 126.97428,37.57416 126.97433,37.574165 126.974335,37.57417"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 29,
                                             "description": "우측 횡단보도 후 보행자도로 을 따라 29m 이동 ",
                                             "linestring": "126.974335,37.57417 126.97445,37.574085 126.97458,37.57399"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 189,
                                             "description": "우회전 후 189m 이동 ",
                                             "linestring": "126.97458,37.57399 126.97455,37.573975 126.97453,37.573956 126.97458,37.57356 126.97461,37.57328 126.97465,37.57296 126.97472,37.572403 126.974724,37.572372 126.974785,37.57233"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 55,
                                             "description": "가미 에서 2시 방향 우회전 후 55m 이동 ",
                                             "linestring": "126.974785,37.57233 126.974815,37.57212 126.97483,37.572002 126.974846,37.571835"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 138,
                                             "description": "좌회전 후 보행자도로 을 따라 138m 이동 ",
                                             "linestring": "126.974846,37.571835 126.97486,37.571728 126.97487,37.57171 126.97491,37.571674 126.97493,37.571663 126.97496,37.571667 126.97519,37.571667 126.97527,37.571667 126.97533,37.57163 126.975395,37.57163 126.97582,37.571625 126.97623,37.571625"
                                        }
                                   ]
                              },
                              {
                                   "mode": "SUBWAY",
                                   "routeColor": "996CAC",
                                   "sectionTime": 120,
                                   "route": "수도권5호선",
                                   "routeId": "110051011",
                                   "distance": 1057,
                                   "service": 0,
                                   "start": {
                                        "name": "광화문",
                                        "lon": 126.97622777777778,
                                        "lat": 37.571644444444445
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "광화문",
                                                  "lon": "126.976228",
                                                  "lat": "37.571644",
                                                  "stationID": "110524"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "서대문",
                                                  "lon": "126.966728",
                                                  "lat": "37.565847",
                                                  "stationID": "110523"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "서대문",
                                        "lon": 126.96672777777778,
                                        "lat": 37.565847222222224
                                   },
                                   "type": 5,
                                   "passShape": {
                                        "linestring": "126.976228,37.571647 126.974733,37.571647 126.974503,37.571631 126.974281,37.571600 126.974033,37.571533 126.973850,37.571453 126.973717,37.571378 126.973581,37.571289 126.972650,37.570583 126.972383,37.570403 126.972250,37.570322 126.971703,37.570050 126.971431,37.569897 126.969378,37.568506 126.969353,37.568492 126.969331,37.568475 126.969306,37.568456 126.969281,37.568439 126.969258,37.568422 126.969233,37.568406 126.969211,37.568386 126.969189,37.568369 126.969167,37.568350 126.969142,37.568333 126.969119,37.568314 126.969100,37.568294 126.969078,37.568275 126.969056,37.568256 126.969036,37.568236 126.969014,37.568217 126.968994,37.568197 126.968975,37.568178 126.968956,37.568156 126.968933,37.568136 126.968917,37.568117 126.967275,37.566464 126.967206,37.566392 126.966408,37.565483"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 1292,
                                   "distance": 1573,
                                   "start": {
                                        "name": "서대문",
                                        "lon": 126.96672777777778,
                                        "lat": 37.565847222222224
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "",
                                             "distance": 46,
                                             "description": "46m 이동",
                                             "linestring": "126.96671,37.565853 126.966675,37.56581 126.9664,37.56552"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 38,
                                             "description": "서대문역 에서 좌회전 후 38m 이동 ",
                                             "linestring": "126.9664,37.56552 126.966736,37.56531"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 17,
                                             "description": "서대문아트홀 에서 좌회전 후 17m 이동 ",
                                             "linestring": "126.966736,37.56531 126.966896,37.565323 126.96692,37.565342"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 79,
                                             "description": "서대문역  7번출구 에서 우회전 후 79m 이동 ",
                                             "linestring": "126.96692,37.565342 126.96699,37.565273 126.96715,37.565067 126.967384,37.56475 126.96738,37.564735"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 32,
                                             "description": "하루돈 제주 흙돼지 에서 좌측 횡단보도 후 보행자도로 을 따라 32m 이동 ",
                                             "linestring": "126.96738,37.564735 126.96756,37.564495"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 317,
                                             "description": "카페루이스 서대문점 에서 직진 후 통일로 을 따라 317m 이동 ",
                                             "linestring": "126.96756,37.564495 126.9676,37.564476 126.96761,37.564453 126.96817,37.563698 126.96826,37.56357 126.96845,37.56328 126.96853,37.563168 126.968735,37.56289 126.968956,37.56258 126.9692,37.56228 126.9692,37.562065 126.96911,37.562042"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 38,
                                             "description": "횡단보도 후 보행자도로 을 따라 38m 이동 ",
                                             "linestring": "126.96911,37.562042 126.96925,37.561726"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 284,
                                             "description": "직진 후 통일로 을 따라 284m 이동 ",
                                             "linestring": "126.96925,37.561726 126.96939,37.56175 126.96946,37.56175 126.9695,37.56175 126.969536,37.561726 126.96958,37.561676 126.96983,37.56138 126.97003,37.561104 126.9702,37.560883 126.970375,37.56069 126.9705,37.56053 126.97076,37.560173 126.97091,37.55993 126.97101,37.559757 126.97102,37.559734"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 35,
                                             "description": "횡단보도 후 35m 이동 ",
                                             "linestring": "126.97102,37.559734 126.97114,37.55943"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 42,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 42m 이동 ",
                                             "linestring": "126.97114,37.55943 126.97161,37.559498"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 8,
                                             "description": "직진 후 통일로 을 따라 8m 이동 ",
                                             "linestring": "126.97161,37.559498 126.97164,37.55951 126.971695,37.559494"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 10,
                                             "description": "횡단보도 후 보행자도로 을 따라 10m 이동 ",
                                             "linestring": "126.971695,37.559494 126.97179,37.55944"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 47,
                                             "description": "채덕수세무회계사무소 에서 좌회전 후 통일로 을 따라 47m 이동 ",
                                             "linestring": "126.97179,37.55944 126.97185,37.559505 126.97227,37.559532"
                                        },
                                        {
                                             "streetName": "칠패로",
                                             "distance": 39,
                                             "description": "우회전 후 칠패로 을 따라 39m 이동 ",
                                             "linestring": "126.97391,37.559654 126.97405,37.55966 126.97406,37.55966 126.97408,37.559654 126.97417,37.55952 126.97419,37.55946"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 41,
                                             "description": "좌측 횡단보도 후 보행자도로 을 따라 41m 이동 ",
                                             "linestring": "126.97378,37.55883 126.973946,37.558735 126.97417,37.55862"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 186,
                                             "description": "남선빌딩 에서 좌회전 후 186m 이동 ",
                                             "linestring": "126.97417,37.55862 126.9746,37.55915 126.97468,37.559284 126.97475,37.559612 126.9748,37.559788 126.97485,37.559925 126.97491,37.56002 126.974976,37.560097 126.975,37.560123"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 68,
                                             "description": "우회전 후 세종대로 을 따라 68m 이동 ",
                                             "linestring": "126.975,37.560123 126.975075,37.560184 126.97518,37.560238 126.975296,37.56028 126.97541,37.56029 126.97548,37.560287 126.9755,37.560276 126.97555,37.56026 126.97558,37.560238 126.97561,37.560204 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "보행자도로, 18m",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 1843,
                         "transferCount": 0,
                         "totalDistance": 2587,
                         "pathType": 1,
                         "totalWalkDistance": 2248
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 9900,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 4974,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 134,
                                   "distance": 185,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "서울경찰청.경복궁역",
                                        "lon": 126.97145,
                                        "lat": 37.57587777777778
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 7,
                                             "description": "좌회전 후 보행자도로 을 따라 7m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108"
                                        },
                                        {
                                             "streetName": "사직로",
                                             "distance": 103,
                                             "description": "경복궁역  7번출구 에서 좌회전 후 사직로 을 따라 103m 이동 ",
                                             "linestring": "126.972565,37.57566 126.97248,37.57573 126.97239,37.57574 126.97218,37.575764 126.971565,37.575832 126.97144,37.575844"
                                        }
                                   ]
                              },
                              {
                                   "mode": "BUS",
                                   "routeColor": "0068B7",
                                   "sectionTime": 2567,
                                   "route": "간선:272",
                                   "routeId": "11448001",
                                   "distance": 8267,
                                   "service": 0,
                                   "start": {
                                        "name": "서울경찰청.경복궁역",
                                        "lon": 126.97145,
                                        "lat": 37.57587777777778
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "서울경찰청.경복궁역",
                                                  "lon": "126.971450",
                                                  "lat": "37.575878",
                                                  "stationID": "758478"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "경복궁",
                                                  "lon": "126.978747",
                                                  "lat": "37.575617",
                                                  "stationID": "758458"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "안국역.인사동",
                                                  "lon": "126.984169",
                                                  "lat": "37.575822",
                                                  "stationID": "758471"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "창덕궁.우리소리박물관",
                                                  "lon": "126.988989",
                                                  "lat": "37.577283",
                                                  "stationID": "758526"
                                             },
                                             {
                                                  "index": 4,
                                                  "stationName": "창경궁.서울대학교병원",
                                                  "lon": "126.996822",
                                                  "lat": "37.578869",
                                                  "stationID": "758588"
                                             },
                                             {
                                                  "index": 5,
                                                  "stationName": "명륜동2가.성균관대입구",
                                                  "lon": "126.999503",
                                                  "lat": "37.583539",
                                                  "stationID": "758802"
                                             },
                                             {
                                                  "index": 6,
                                                  "stationName": "삼선교.한성대학교.조소앙활동터",
                                                  "lon": "127.008236",
                                                  "lat": "37.589269",
                                                  "stationID": "775747"
                                             },
                                             {
                                                  "index": 7,
                                                  "stationName": "돈암초교입구",
                                                  "lon": "127.012158",
                                                  "lat": "37.591139",
                                                  "stationID": "775818"
                                             },
                                             {
                                                  "index": 8,
                                                  "stationName": "삼선동주민센터",
                                                  "lon": "127.014492",
                                                  "lat": "37.590553",
                                                  "stationID": "775798"
                                             },
                                             {
                                                  "index": 9,
                                                  "stationName": "성북구청.성북경찰서",
                                                  "lon": "127.017428",
                                                  "lat": "37.588150",
                                                  "stationID": "775680"
                                             },
                                             {
                                                  "index": 10,
                                                  "stationName": "보문역",
                                                  "lon": "127.018983",
                                                  "lat": "37.585822",
                                                  "stationID": "775561"
                                             },
                                             {
                                                  "index": 11,
                                                  "stationName": "보문동성당",
                                                  "lon": "127.020858",
                                                  "lat": "37.582328",
                                                  "stationID": "775471"
                                             },
                                             {
                                                  "index": 12,
                                                  "stationName": "보문동주민센터",
                                                  "lon": "127.021903",
                                                  "lat": "37.580414",
                                                  "stationID": "775412"
                                             },
                                             {
                                                  "index": 13,
                                                  "stationName": "신설동역",
                                                  "lon": "127.025250",
                                                  "lat": "37.576150",
                                                  "stationID": "775282"
                                             },
                                             {
                                                  "index": 14,
                                                  "stationName": "용두동사거리",
                                                  "lon": "127.030111",
                                                  "lat": "37.577539",
                                                  "stationID": "775322"
                                             },
                                             {
                                                  "index": 15,
                                                  "stationName": "제기동역.서울약령시",
                                                  "lon": "127.037442",
                                                  "lat": "37.578072",
                                                  "stationID": "775336"
                                             },
                                             {
                                                  "index": 16,
                                                  "stationName": "청량리수산시장",
                                                  "lon": "127.041825",
                                                  "lat": "37.579014",
                                                  "stationID": "775365"
                                             },
                                             {
                                                  "index": 17,
                                                  "stationName": "청량리역환승센터(3번승강장)",
                                                  "lon": "127.045953",
                                                  "lat": "37.580481",
                                                  "stationID": "775408"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "청량리역환승센터(3번승강장)",
                                        "lon": 127.04595277777777,
                                        "lat": 37.58048055555555
                                   },
                                   "type": 11,
                                   "passShape": {
                                        "linestring": "126.971433,37.575911 126.972733,37.575819 126.975258,37.575617 126.975606,37.575553 126.975839,37.575492 126.976350,37.575175 126.976628,37.575089 126.976944,37.575075 126.977136,37.575128 126.977258,37.575175 126.977814,37.575489 126.978067,37.575581 126.978469,37.575653 126.978717,37.575683 126.979272,37.575756 126.979583,37.575808 126.979736,37.575836 126.980147,37.575861 126.980322,37.575850 126.982028,37.575586 126.982592,37.575522 126.982875,37.575525 126.983217,37.575561 126.983425,37.575600 126.983689,37.575681 126.984167,37.575858 126.984256,37.575889 126.986125,37.576750 126.986283,37.576825 126.986708,37.577036 126.986922,37.577122 126.987128,37.577194 126.987500,37.577283 126.988969,37.577317 126.989267,37.577325 126.990211,37.577375 126.991019,37.577467 126.991950,37.577519 126.992356,37.577517 126.992925,37.577425 126.993469,37.577300 126.994153,37.577036 126.996244,37.576183 126.997114,37.575881 126.997264,37.575853 126.997356,37.575883 126.997431,37.575975 126.997292,37.577000 126.997269,37.577086 126.996819,37.578575 126.996781,37.578856 126.996550,37.580467 126.996542,37.580628 126.996592,37.580900 126.996656,37.581050 126.996731,37.581153 126.996856,37.581272 126.997944,37.582192 126.998753,37.582911 126.998875,37.583019 126.999222,37.583331 126.999458,37.583553 126.999622,37.583706 127.000000,37.584097 127.000508,37.584631 127.001003,37.585206 127.001486,37.585789 127.001556,37.585850 127.002133,37.586528 127.002322,37.586706 127.002647,37.586969 127.003094,37.587247 127.003572,37.587461 127.004678,37.587842 127.006125,37.588392 127.006286,37.588458 127.008233,37.589306 127.009444,37.589831 127.010969,37.590553 127.012117,37.591156 127.013189,37.591714 127.013381,37.591494 127.014519,37.590583 127.015425,37.589858 127.017442,37.588183 127.017719,37.587953 127.017956,37.587703 127.018169,37.587406 127.019028,37.585833 127.019278,37.585375 127.019350,37.585242 127.020361,37.583331 127.020903,37.582339 127.021867,37.580572 127.021939,37.580436 127.022911,37.578606 127.023069,37.578367 127.023122,37.576178 127.023133,37.575625 127.023242,37.575586 127.023414,37.575578 127.023914,37.575775 127.025200,37.576175 127.025228,37.576183 127.028344,37.577056 127.030089,37.577569 127.030400,37.577661 127.030581,37.577714 127.031100,37.577856 127.031703,37.577994 127.032378,37.578072 127.036372,37.578106 127.037419,37.578106 127.038231,37.578103 127.038414,37.578111 127.038728,37.578144 127.039303,37.578253 127.041822,37.579050 127.042503,37.579267 127.042672,37.579319 127.045083,37.580072 127.045256,37.580131 127.045558,37.580256 127.045828,37.580419 127.045908,37.580489"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 240,
                                   "distance": 258,
                                   "start": {
                                        "name": "청량리역환승센터(3번승강장)",
                                        "lon": 127.04595277777777,
                                        "lat": 37.58048055555555
                                   },
                                   "end": {
                                        "name": "청량리",
                                        "lon": 127.0485,
                                        "lat": 37.58074166666667
                                   },
                                   "passShape": {
                                        "linestring": "127.045953,37.580481 127.045972,37.580514 127.046128,37.580600 127.046194,37.580578 127.046292,37.580708 127.046436,37.580803 127.046539,37.580858 127.046636,37.580919 127.046736,37.580936 127.046814,37.580922 127.047100,37.580831 127.047147,37.580833 127.047217,37.580856 127.047292,37.580961 127.047353,37.581006 127.047414,37.581036 127.047517,37.581058 127.047650,37.581103 127.047725,37.581156 127.047794,37.581236 127.047842,37.581211 127.047950,37.581158 127.047908,37.581094 127.048117,37.580997 127.048500,37.580742"
                                   }
                              },
                              {
                                   "routeColor": "F75C4C",
                                   "distance": 7466,
                                   "start": {
                                        "name": "청량리",
                                        "lon": 127.0485,
                                        "lat": 37.58074166666667
                                   },
                                   "type": 3,
                                   "mode": "TRAIN",
                                   "sectionTime": 1203,
                                   "route": "KTX이음:청량리-서울",
                                   "routeId": "500010-500001-KTXEUM001",
                                   "service": 0,
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "청량리",
                                                  "lon": "127.048500",
                                                  "lat": "37.580742",
                                                  "stationID": "500010"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "서울",
                                                  "lon": "126.970608",
                                                  "lat": "37.554639",
                                                  "stationID": "500001"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "서울",
                                        "lon": 126.97060833333333,
                                        "lat": 37.55463888888889
                                   },
                                   "passShape": {
                                        "linestring": "127.048500,37.580742 126.970608,37.554639"
                                   },
                                   "routePayment": 8400
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 830,
                                   "distance": 1031,
                                   "start": {
                                        "name": "서울",
                                        "lon": 126.97060833333333,
                                        "lat": 37.55463888888889
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 267,
                                             "description": "보행자도로 을 따라 267m 이동",
                                             "linestring": "126.9706,37.554844 126.970795,37.554848 126.97078,37.555195 126.9717,37.555172 126.9717,37.555542 126.97171,37.556343"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 28,
                                             "description": "서울역  2번출구 에서 우회전 후 보행자도로 을 따라 28m 이동 ",
                                             "linestring": "126.97171,37.556343 126.97202,37.556343"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 21,
                                             "description": "좌회전 후 보행자도로 을 따라 21m 이동 ",
                                             "linestring": "126.97202,37.556343 126.972015,37.556385 126.972145,37.556496"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 103,
                                             "description": "좌회전 후 통일로 을 따라 103m 이동 ",
                                             "linestring": "126.972145,37.556496 126.97209,37.55669 126.97204,37.55687 126.97196,37.55699 126.97186,37.5571 126.97164,37.557316"
                                        },
                                        {
                                             "streetName": "일반보행자도로",
                                             "distance": 66,
                                             "description": "지하보도 진입 후 일반보행자도로 을 따라 66m 이동 ",
                                             "linestring": "126.97164,37.557316 126.971695,37.557423 126.97197,37.557693 126.97208,37.557785"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 85,
                                             "description": "금자네생등심 에서 우회전 후 통일로 을 따라 85m 이동 ",
                                             "linestring": "126.97208,37.557785 126.97212,37.557682 126.97214,37.55766 126.97219,37.557613 126.972305,37.557583 126.97246,37.55756 126.97259,37.557564 126.97263,37.55757 126.9727,37.557617 126.972824,37.557716"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 41,
                                             "description": "로티보이 남대문점 에서 우측 횡단보도 후 보행자도로 을 따라 41m 이동 ",
                                             "linestring": "126.9733,37.55829 126.97348,37.558197 126.973694,37.55809"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 258,
                                             "description": "죽이야기 에서 좌회전 후 258m 이동 ",
                                             "linestring": "126.973694,37.55809 126.97409,37.55854 126.97417,37.55862 126.9746,37.55915 126.97468,37.559284 126.97475,37.559612 126.9748,37.559788 126.97485,37.559925 126.97491,37.56002 126.974976,37.560097 126.975,37.560123"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 68,
                                             "description": "우회전 후 세종대로 을 따라 68m 이동 ",
                                             "linestring": "126.975,37.560123 126.975075,37.560184 126.97518,37.560238 126.975296,37.56028 126.97541,37.56029 126.97548,37.560287 126.9755,37.560276 126.97555,37.56026 126.97558,37.560238 126.97561,37.560204 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "보행자도로, 18m",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 1204,
                         "transferCount": 1,
                         "totalDistance": 16826,
                         "pathType": 5,
                         "totalWalkDistance": 1474
                    },
                    {
                         "fare": {
                              "regular": {
                                   "totalFare": 9900,
                                   "currency": {
                                        "symbol": "￦",
                                        "currency": "원",
                                        "currencyCode": "KRW"
                                   }
                              }
                         },
                         "totalTime": 5075,
                         "legs": [
                              {
                                   "mode": "WALK",
                                   "sectionTime": 230,
                                   "distance": 240,
                                   "start": {
                                        "name": "출발지",
                                        "lon": 126.9720724,
                                        "lat": 37.5750599
                                   },
                                   "end": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 2,
                                             "description": "보행자도로 을 따라 2m 이동",
                                             "linestring": "126.972466,37.575066 126.972466,37.575047"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 12,
                                             "description": "좌회전 후 보행자도로 을 따라 12m 이동 ",
                                             "linestring": "126.972466,37.575047 126.97261,37.57505"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 68,
                                             "description": "좌회전 후 68m 이동 ",
                                             "linestring": "126.97261,37.57505 126.97261,37.575108 126.972595,37.575386 126.97257,37.575645 126.972565,37.57566"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 14,
                                             "description": "경복궁역  7번출구 에서 우측 횡단보도 후 보행자도로 을 따라 14m 이동 ",
                                             "linestring": "126.972565,37.57566 126.97271,37.575638"
                                        },
                                        {
                                             "streetName": "사직로",
                                             "distance": 79,
                                             "description": "경복궁역  7번출구 에서 직진 후 사직로 을 따라 79m 이동 ",
                                             "linestring": "126.97271,37.575638 126.97276,37.5757 126.97278,37.5757 126.973206,37.575653 126.973564,37.57562"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 39,
                                             "description": "광화문칼국수 에서 좌측 횡단보도 후 39m 이동 ",
                                             "linestring": "126.973564,37.57562 126.973595,37.575974"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 26,
                                             "description": "아이러브플라워(I LOVE 에서 우회전 후 보행자도로 을 따라 26m 이동 ",
                                             "linestring": "126.973595,37.575974 126.97382,37.57595 126.973885,37.575947"
                                        }
                                   ]
                              },
                              {
                                   "mode": "SUBWAY",
                                   "routeColor": "EF7C1C",
                                   "sectionTime": 788,
                                   "route": "수도권3호선",
                                   "routeId": "110031010",
                                   "distance": 6321,
                                   "service": 0,
                                   "start": {
                                        "name": "경복궁",
                                        "lon": 126.97386666666667,
                                        "lat": 37.57581944444444
                                   },
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "경복궁",
                                                  "lon": "126.973867",
                                                  "lat": "37.575819",
                                                  "stationID": "110319"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "안국",
                                                  "lon": "126.985356",
                                                  "lat": "37.576506",
                                                  "stationID": "110320"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "종로3가",
                                                  "lon": "126.991825",
                                                  "lat": "37.571708",
                                                  "stationID": "110321"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "을지로3가",
                                                  "lon": "126.992569",
                                                  "lat": "37.566803",
                                                  "stationID": "110322"
                                             },
                                             {
                                                  "index": 4,
                                                  "stationName": "충무로",
                                                  "lon": "126.994439",
                                                  "lat": "37.560953",
                                                  "stationID": "110323"
                                             },
                                             {
                                                  "index": 5,
                                                  "stationName": "동대입구",
                                                  "lon": "127.005353",
                                                  "lat": "37.559075",
                                                  "stationID": "110324"
                                             },
                                             {
                                                  "index": 6,
                                                  "stationName": "약수",
                                                  "lon": "127.010994",
                                                  "lat": "37.554358",
                                                  "stationID": "110325"
                                             },
                                             {
                                                  "index": 7,
                                                  "stationName": "금호",
                                                  "lon": "127.015789",
                                                  "lat": "37.548303",
                                                  "stationID": "110326"
                                             },
                                             {
                                                  "index": 8,
                                                  "stationName": "옥수",
                                                  "lon": "127.017589",
                                                  "lat": "37.541242",
                                                  "stationID": "110327"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "옥수",
                                        "lon": 127.0175888888889,
                                        "lat": 37.541241666666664
                                   },
                                   "type": 3,
                                   "passShape": {
                                        "linestring": "126.973867,37.575819 126.974297,37.575775 126.975078,37.575753 126.976378,37.575706 126.977056,37.575706 126.978153,37.575742 126.978583,37.575764 126.979089,37.575803 126.979558,37.575850 126.980111,37.575875 126.980367,37.575869 126.980625,37.575847 126.981281,37.575772 126.981722,37.575703 126.982542,37.575539 126.982569,37.575533 126.982628,37.575528 126.982683,37.575525 126.982739,37.575525 126.982794,37.575525 126.982822,37.575528 126.982850,37.575528 126.982906,37.575536 126.982933,37.575539 126.982989,37.575550 126.983042,37.575564 126.983069,37.575572 126.983119,37.575589 126.984275,37.576042 126.985356,37.576506 126.985803,37.576700 126.986114,37.576842 126.986639,37.577117 126.986678,37.577133 126.986756,37.577167 126.986836,37.577194 126.986917,37.577222 126.987000,37.577247 126.987042,37.577256 126.987125,37.577278 126.987208,37.577292 126.987253,37.577300 126.987339,37.577314 126.987381,37.577317 126.987469,37.577325 126.987514,37.577328 126.989664,37.577347 126.989700,37.577344 126.989736,37.577342 126.989772,37.577336 126.989808,37.577328 126.989842,37.577319 126.989878,37.577308 126.989908,37.577294 126.989942,37.577281 126.989969,37.577264 126.990000,37.577247 126.990028,37.577228 126.990053,37.577206 126.990078,37.577183 126.990100,37.577161 126.990119,37.577136 126.990136,37.577111 126.990153,37.577083 126.990167,37.577058 126.990178,37.577031 126.990183,37.577003 126.990353,37.576500 126.990375,37.576428 126.991242,37.573556 126.991544,37.572597 126.991825,37.571708 126.992050,37.570994 126.992083,37.570836 126.992142,37.570472 126.992147,37.570433 126.992367,37.568378 126.992628,37.566381 126.992717,37.565714 126.992750,37.565350 126.992844,37.564303 126.993081,37.562561 126.993122,37.562383 126.993178,37.562231 126.993239,37.562094 126.993317,37.561961 126.993664,37.561617 126.994028,37.561314 126.994111,37.561242 126.994444,37.560956 126.994492,37.560914 126.994819,37.560781 126.994864,37.560764 126.994953,37.560731 126.995044,37.560700 126.995136,37.560669 126.995181,37.560658 126.995275,37.560631 126.995367,37.560606 126.995461,37.560583 126.995558,37.560564 126.995653,37.560547 126.995750,37.560531 126.997383,37.560356 126.997719,37.560308 126.998050,37.560253 126.998378,37.560183 127.003161,37.559044 127.003328,37.559014 127.003519,37.558992 127.003717,37.558986 127.004669,37.559031 127.005350,37.559075 127.005353,37.559075 127.005742,37.559078 127.006219,37.559014 127.006383,37.558972 127.006547,37.558925 127.006708,37.558875 127.006867,37.558817 127.007022,37.558756 127.007175,37.558689 127.007322,37.558617 127.007467,37.558542 127.007608,37.558464 127.007747,37.558378 127.007881,37.558292 127.008008,37.558200 127.008133,37.558103 127.008253,37.558003 127.008369,37.557900 127.008478,37.557792 127.008583,37.557683 127.008683,37.557569 127.008775,37.557453 127.008864,37.557333 127.010181,37.555369 127.010597,37.554839 127.010642,37.554781 127.010658,37.554761 127.010992,37.554356 127.011739,37.553444 127.012128,37.553000 127.012964,37.552097 127.013344,37.551650 127.015108,37.549389 127.015333,37.549075 127.015639,37.548597 127.015769,37.548344 127.015789,37.548303 127.015950,37.547992 127.016419,37.546961 127.016433,37.546925 127.016464,37.546844 127.016492,37.546767 127.016517,37.546689 127.016539,37.546608 127.016550,37.546569 127.016567,37.546489 127.016583,37.546408 127.016589,37.546369 127.016600,37.546289 127.016608,37.546208 127.016706,37.544942 127.016756,37.543986 127.016789,37.543628 127.016839,37.543222 127.016903,37.542867 127.016992,37.542492 127.017119,37.542106 127.017289,37.541753 127.017583,37.541242"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 424,
                                   "distance": 400,
                                   "start": {
                                        "name": "옥수",
                                        "lon": 127.0175888888889,
                                        "lat": 37.541241666666664
                                   },
                                   "end": {
                                        "name": "옥수",
                                        "lon": 127.01872222222222,
                                        "lat": 37.540525
                                   },
                                   "passShape": {
                                        "linestring": "127.017589,37.541242 127.017567,37.541244 127.017497,37.541222 127.017428,37.541328 127.017778,37.541367 127.017675,37.541567 127.017794,37.541581 127.017883,37.541592 127.018419,37.541656 127.018667,37.541681 127.018739,37.541692 127.019103,37.541731 127.019339,37.541767 127.019372,37.541694 127.019453,37.541578 127.019558,37.541442 127.019553,37.541414 127.019536,37.541367 127.019122,37.540992 127.018956,37.540669 127.018953,37.540550 127.018722,37.540525"
                                   }
                              },
                              {
                                   "routeColor": "77C4A3",
                                   "distance": 9211,
                                   "start": {
                                        "name": "옥수",
                                        "lon": 127.01872222222222,
                                        "lat": 37.540525
                                   },
                                   "Lane": [
                                        {
                                             "routeColor": "77C4A3",
                                             "route": "경의중앙선",
                                             "routeId": "110121009",
                                             "service": 0,
                                             "type": 104
                                        }
                                   ],
                                   "type": 122,
                                   "mode": "SUBWAY",
                                   "sectionTime": 1060,
                                   "route": "경의중앙선(급행)",
                                   "routeId": "111121004",
                                   "service": 0,
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "옥수",
                                                  "lon": "127.018722",
                                                  "lat": "37.540525",
                                                  "stationID": "111225"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "응봉",
                                                  "lon": "127.034544",
                                                  "lat": "37.550053",
                                                  "stationID": "111224"
                                             },
                                             {
                                                  "index": 2,
                                                  "stationName": "왕십리",
                                                  "lon": "127.038528",
                                                  "lat": "37.561531",
                                                  "stationID": "111223"
                                             },
                                             {
                                                  "index": 3,
                                                  "stationName": "청량리",
                                                  "lon": "127.047875",
                                                  "lat": "37.579942",
                                                  "stationID": "111222"
                                             },
                                             {
                                                  "index": 4,
                                                  "stationName": "회기",
                                                  "lon": "127.058083",
                                                  "lat": "37.589664",
                                                  "stationID": "111221"
                                             },
                                             {
                                                  "index": 5,
                                                  "stationName": "중랑",
                                                  "lon": "127.076211",
                                                  "lat": "37.594956",
                                                  "stationID": "111220"
                                             },
                                             {
                                                  "index": 6,
                                                  "stationName": "상봉",
                                                  "lon": "127.085203",
                                                  "lat": "37.596842",
                                                  "stationID": "111219"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "상봉",
                                        "lon": 127.08520277777778,
                                        "lat": 37.59684166666667
                                   },
                                   "passShape": {
                                        "linestring": "127.018736,37.540511 127.020686,37.541767 127.021619,37.542442 127.021953,37.542683 127.023269,37.543683 127.023519,37.543864 127.023800,37.544064 127.024036,37.544217 127.024267,37.544347 127.024558,37.544503 127.024833,37.544636 127.025114,37.544750 127.025381,37.544839 127.025669,37.544931 127.026336,37.545111 127.027953,37.545569 127.028078,37.545611 127.028139,37.545631 127.028200,37.545653 127.028261,37.545675 127.028322,37.545697 127.028383,37.545719 127.028444,37.545744 127.028503,37.545767 127.028564,37.545792 127.028622,37.545817 127.028683,37.545842 127.028742,37.545867 127.028800,37.545894 127.028858,37.545919 127.028917,37.545947 127.028975,37.545975 127.029031,37.546003 127.029089,37.546031 127.032158,37.547544 127.032247,37.547589 127.032336,37.547636 127.032425,37.547683 127.032508,37.547733 127.032594,37.547783 127.032678,37.547836 127.032758,37.547892 127.032839,37.547944 127.032917,37.548003 127.032992,37.548061 127.033067,37.548119 127.033142,37.548181 127.033214,37.548244 127.033281,37.548308 127.033350,37.548372 127.033392,37.548414 127.033417,37.548439 127.033478,37.548506 127.033542,37.548575 127.033600,37.548644 127.033658,37.548717 127.033714,37.548786 127.034525,37.550017 127.034547,37.550050 127.034947,37.550611 127.034992,37.550667 127.035039,37.550719 127.035089,37.550775 127.035136,37.550828 127.035186,37.550881 127.035236,37.550931 127.035289,37.550981 127.035342,37.551033 127.035397,37.551081 127.035453,37.551131 127.035508,37.551178 127.035567,37.551225 127.035625,37.551272 127.035683,37.551319 127.035744,37.551364 127.035806,37.551408 127.035867,37.551450 127.035931,37.551492 127.035994,37.551533 127.036058,37.551575 127.036125,37.551617 127.037769,37.552650 127.038211,37.552967 127.038356,37.553083 127.038494,37.553203 127.038625,37.553331 127.038747,37.553458 127.038864,37.553594 127.038972,37.553733 127.039072,37.553875 127.039164,37.554019 127.039250,37.554169 127.039325,37.554319 127.039389,37.554475 127.039447,37.554631 127.039497,37.554789 127.039536,37.554950 127.039567,37.555111 127.039589,37.555272 127.039603,37.555436 127.039606,37.555600 127.039600,37.555761 127.039583,37.555925 127.039558,37.556086 127.039492,37.556456 127.038567,37.561286 127.038522,37.561528 127.038308,37.562647 127.037778,37.565417 127.037761,37.565531 127.037750,37.565644 127.037744,37.565758 127.037742,37.565872 127.037742,37.565986 127.037750,37.566103 127.037761,37.566217 127.037778,37.566328 127.037797,37.566442 127.037819,37.566556 127.037850,37.566667 127.037883,37.566778 127.037919,37.566889 127.037964,37.567000 127.038008,37.567106 127.038058,37.567214 127.038114,37.567319 127.038172,37.567425 127.038236,37.567528 127.038303,37.567628 127.038375,37.567728 127.038722,37.568219 127.040781,37.570906 127.042075,37.572578 127.043939,37.574981 127.046050,37.577747 127.046983,37.578828 127.047394,37.579303 127.047594,37.579567 127.048269,37.580469 127.050106,37.582919 127.052189,37.585697 127.052314,37.585847 127.052439,37.585994 127.052569,37.586139 127.052706,37.586283 127.052842,37.586425 127.052983,37.586564 127.053128,37.586700 127.053278,37.586833 127.053431,37.586967 127.053583,37.587094 127.053742,37.587222 127.053906,37.587344 127.054069,37.587467 127.054239,37.587586 127.054408,37.587703 127.054581,37.587817 127.054758,37.587928 127.054939,37.588033 127.055119,37.588139 127.055306,37.588242 127.055492,37.588339 127.056483,37.588892 127.058019,37.589714 127.058036,37.589719 127.058364,37.589897 127.061892,37.591694 127.061939,37.591717 127.061986,37.591739 127.062036,37.591758 127.062083,37.591781 127.062133,37.591800 127.062183,37.591819 127.062233,37.591839 127.062283,37.591858 127.062333,37.591878 127.062383,37.591894 127.062433,37.591914 127.062486,37.591931 127.062539,37.591947 127.062589,37.591964 127.062642,37.591978 127.062694,37.591992 127.062747,37.592008 127.062800,37.592022 127.062853,37.592033 127.062906,37.592047 127.062958,37.592058 127.070211,37.593622 127.071689,37.593939 127.074900,37.594650 127.076214,37.594947 127.077703,37.595286 127.081597,37.596078 127.085200,37.596844"
                                   }
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 160,
                                   "distance": 178,
                                   "start": {
                                        "name": "상봉",
                                        "lon": 127.08520277777778,
                                        "lat": 37.59684166666667
                                   },
                                   "end": {
                                        "name": "상봉",
                                        "lon": 127.08585555555555,
                                        "lat": 37.597097222222224
                                   },
                                   "passShape": {
                                        "linestring": "127.085203,37.596842 127.085197,37.596900 127.085717,37.597028 127.085511,37.597483 127.085311,37.597450 127.085319,37.597408 127.085356,37.597253 127.085856,37.597097"
                                   }
                              },
                              {
                                   "routeColor": "F75C4C",
                                   "distance": 11218,
                                   "start": {
                                        "name": "상봉",
                                        "lon": 127.08585555555555,
                                        "lat": 37.597097222222224
                                   },
                                   "type": 3,
                                   "mode": "TRAIN",
                                   "sectionTime": 1583,
                                   "route": "KTX이음:상봉-서울",
                                   "routeId": "500006-500001-KTXEUM001",
                                   "service": 0,
                                   "passStopList": {
                                        "stationList": [
                                             {
                                                  "index": 0,
                                                  "stationName": "상봉",
                                                  "lon": "127.085856",
                                                  "lat": "37.597097",
                                                  "stationID": "500006"
                                             },
                                             {
                                                  "index": 1,
                                                  "stationName": "서울",
                                                  "lon": "126.970608",
                                                  "lat": "37.554639",
                                                  "stationID": "500001"
                                             }
                                        ]
                                   },
                                   "end": {
                                        "name": "서울",
                                        "lon": 126.97060833333333,
                                        "lat": 37.55463888888889
                                   },
                                   "passShape": {
                                        "linestring": "127.085856,37.597097 126.970608,37.554639"
                                   },
                                   "routePayment": 8400
                              },
                              {
                                   "mode": "WALK",
                                   "sectionTime": 830,
                                   "distance": 1031,
                                   "start": {
                                        "name": "서울",
                                        "lon": 126.97060833333333,
                                        "lat": 37.55463888888889
                                   },
                                   "end": {
                                        "name": "도착지",
                                        "lon": 126.9753282,
                                        "lat": 37.5599922
                                   },
                                   "steps": [
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 267,
                                             "description": "보행자도로 을 따라 267m 이동",
                                             "linestring": "126.9706,37.554844 126.970795,37.554848 126.97078,37.555195 126.9717,37.555172 126.9717,37.555542 126.97171,37.556343"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 28,
                                             "description": "서울역  2번출구 에서 우회전 후 보행자도로 을 따라 28m 이동 ",
                                             "linestring": "126.97171,37.556343 126.97202,37.556343"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 21,
                                             "description": "좌회전 후 보행자도로 을 따라 21m 이동 ",
                                             "linestring": "126.97202,37.556343 126.972015,37.556385 126.972145,37.556496"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 103,
                                             "description": "좌회전 후 통일로 을 따라 103m 이동 ",
                                             "linestring": "126.972145,37.556496 126.97209,37.55669 126.97204,37.55687 126.97196,37.55699 126.97186,37.5571 126.97164,37.557316"
                                        },
                                        {
                                             "streetName": "일반보행자도로",
                                             "distance": 66,
                                             "description": "지하보도 진입 후 일반보행자도로 을 따라 66m 이동 ",
                                             "linestring": "126.97164,37.557316 126.971695,37.557423 126.97197,37.557693 126.97208,37.557785"
                                        },
                                        {
                                             "streetName": "통일로",
                                             "distance": 85,
                                             "description": "금자네생등심 에서 우회전 후 통일로 을 따라 85m 이동 ",
                                             "linestring": "126.97208,37.557785 126.97212,37.557682 126.97214,37.55766 126.97219,37.557613 126.972305,37.557583 126.97246,37.55756 126.97259,37.557564 126.97263,37.55757 126.9727,37.557617 126.972824,37.557716"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 41,
                                             "description": "로티보이 남대문점 에서 우측 횡단보도 후 보행자도로 을 따라 41m 이동 ",
                                             "linestring": "126.9733,37.55829 126.97348,37.558197 126.973694,37.55809"
                                        },
                                        {
                                             "streetName": "",
                                             "distance": 258,
                                             "description": "죽이야기 에서 좌회전 후 258m 이동 ",
                                             "linestring": "126.973694,37.55809 126.97409,37.55854 126.97417,37.55862 126.9746,37.55915 126.97468,37.559284 126.97475,37.559612 126.9748,37.559788 126.97485,37.559925 126.97491,37.56002 126.974976,37.560097 126.975,37.560123"
                                        },
                                        {
                                             "streetName": "세종대로",
                                             "distance": 68,
                                             "description": "우회전 후 세종대로 을 따라 68m 이동 ",
                                             "linestring": "126.975,37.560123 126.975075,37.560184 126.97518,37.560238 126.975296,37.56028 126.97541,37.56029 126.97548,37.560287 126.9755,37.560276 126.97555,37.56026 126.97558,37.560238 126.97561,37.560204 126.975624,37.560154"
                                        },
                                        {
                                             "streetName": "보행자도로",
                                             "distance": 18,
                                             "description": "보행자도로, 18m",
                                             "linestring": "126.975624,37.560154 126.97563,37.56014 126.97563,37.56005 126.97563,37.559998"
                                        }
                                   ]
                              }
                         ],
                         "totalWalkTime": 1644,
                         "transferCount": 2,
                         "totalDistance": 28236,
                         "pathType": 5,
                         "totalWalkDistance": 1849
                    }
               ]
          }
     }
}